DATA DIVISION.
    WORKING-STORAGE SECTION.
    01  WS-AREA.
       05  WS-COUNT PIC 9(5) VALUE 0.
       05  WS-TABLE-SIZE PIC 9(5) VALUE 100.
       05  WS-TABLE-DYNAMIC OCCURS 0 TO 1000 TIMES DEPENDING ON WS-TABLE-SIZE.
          10 WS-ENTRY PIC X(80).

PROCEDURE DIVISION.
    PERFORM VARYING WS-COUNT FROM 1 BY 1 UNTIL WS-COUNT > 500 
       IF WS-COUNT > WS-TABLE-SIZE THEN
           ADD 100 TO WS-TABLE-SIZE
           MOVE WS-TABLE-SIZE TO WS-TABLE-DYNAMIC
       END-IF
       MOVE "Entry " & WS-COUNT TO WS-TABLE-DYNAMIC(WS-COUNT) 
    END-PERFORM.
    DISPLAY "Table populated" 
    STOP RUN.